# Задание №4
# ✔ Создайте вручную список с повторяющимися элементами.
# ✔ Удалите из него все элементы, которые встречаются дважды.

# my_list = [2, 4, 6, 2, 8, 10, 10, 12, 2, 4, 14, 2]
# out = []
# print(my_list)
# for i in my_list:
#     # print(i, my_list.count(i))
#     if my_list.count(i) != 2:
#         # print(i, my_list)
#         out.append(i)
#         # print(out)
# print(out)

# оставляем тех кто 2 раза
# my_list = [2, 4, 6, 2, 8, 10, 10, 12, 2, 4, 14, 2]
# out = []
# print(my_list)
# for i in my_list:
#     if my_list.count(i) == 2:
#         out.append(i)
# print(out)


        