# Задание №4
# ✔ Функция получает на вход список чисел. 
# ✔ Отсортируйте его элементы in place без использования встроенных в язык сортировок. 
# ✔ Как вариант напишите сортировку пузырьком. Её описание есть в википедии.

from random import randint
my_list = []
for i in range(10):
    my_list.append(randint(0, 10))
    #print(my_list[i])
#print(my_list)

