# Задание №2
# ✔ Напишите функцию, которая принимает строку текста. 
# ✔ Сформируйте список с уникальными кодами Unicode каждого 
# символа введённой строки отсортированный по убыванию.

_str1 = "Напишите функцию"  #, которая принимает строку текста."
def F4_2(data: str):
    my_list = sorted(data,reverse=True)
    res = 
    return my_list
print(F4_2(_str1))
